update/sys_soap_message_function_1e361007979f7d5081a6bb46f053afd5.xml

<?xml version="1.0" encoding="UTF-8"?><record_update table="sys_soap_message_function">
    <sys_soap_message_function action="INSERT_OR_UPDATE">
        <authentication_type/>
        <basic_auth_password/>
        <basic_auth_profile/>
        <basic_auth_user/>
        <certificate/>
        <enable_mutual_auth>false</enable_mutual_auth>
        <envelope><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inc="http://www.service-now.com/incident">
   <soapenv:Header/>
   <soapenv:Body>
      <inc:deleteMultiple>
         <!--Optional:-->
         <action_status>${deleteMultiple.action_status}</action_status>
         <!--Optional:-->
         <active>${deleteMultiple.active}</active>
         <!--Optional:-->
         <activity_due>${deleteMultiple.activity_due}</activity_due>
         <!--Optional:-->
         <additional_assignee_list>${deleteMultiple.additional_assignee_list}</additional_assignee_list>
         <!--Optional:-->
         <approval>${deleteMultiple.approval}</approval>
         <!--Optional:-->
         <approval_history>${deleteMultiple.approval_history}</approval_history>
         <!--Optional:-->
         <approval_set>${deleteMultiple.approval_set}</approval_set>
         <!--Optional:-->
         <assigned_to>${deleteMultiple.assigned_to}</assigned_to>
         <!--Optional:-->
         <assignment_group>${deleteMultiple.assignment_group}</assignment_group>
         <!--Optional:-->
         <business_duration>${deleteMultiple.business_duration}</business_duration>
         <!--Optional:-->
         <business_impact>${deleteMultiple.business_impact}</business_impact>
         <!--Optional:-->
         <business_service>${deleteMultiple.business_service}</business_service>
         <!--Optional:-->
         <business_stc>${deleteMultiple.business_stc}</business_stc>
         <!--Optional:-->
         <calendar_duration>${deleteMultiple.calendar_duration}</calendar_duration>
         <!--Optional:-->
         <calendar_stc>${deleteMultiple.calendar_stc}</calendar_stc>
         <!--Optional:-->
         <caller_id>${deleteMultiple.caller_id}</caller_id>
         <!--Optional:-->
         <category>${deleteMultiple.category}</category>
         <!--Optional:-->
         <cause>${deleteMultiple.cause}</cause>
         <!--Optional:-->
         <caused_by>${deleteMultiple.caused_by}</caused_by>
         <!--Optional:-->
         <child_incidents>${deleteMultiple.child_incidents}</child_incidents>
         <!--Optional:-->
         <close_code>${deleteMultiple.close_code}</close_code>
         <!--Optional:-->
         <close_notes>${deleteMultiple.close_notes}</close_notes>
         <!--Optional:-->
         <closed_at>${deleteMultiple.closed_at}</closed_at>
         <!--Optional:-->
         <closed_by>${deleteMultiple.closed_by}</closed_by>
         <!--Optional:-->
         <cmdb_ci>${deleteMultiple.cmdb_ci}</cmdb_ci>
         <!--Optional:-->
         <comments>${deleteMultiple.comments}</comments>
         <!--Optional:-->
         <comments_and_work_notes>${deleteMultiple.comments_and_work_notes}</comments_and_work_notes>
         <!--Optional:-->
         <company>${deleteMultiple.company}</company>
         <!--Optional:-->
         <contact_type>${deleteMultiple.contact_type}</contact_type>
         <!--Optional:-->
         <contract>${deleteMultiple.contract}</contract>
         <!--Optional:-->
         <correlation_display>${deleteMultiple.correlation_display}</correlation_display>
         <!--Optional:-->
         <correlation_id>${deleteMultiple.correlation_id}</correlation_id>
         <!--Optional:-->
         <delivery_plan>${deleteMultiple.delivery_plan}</delivery_plan>
         <!--Optional:-->
         <delivery_task>${deleteMultiple.delivery_task}</delivery_task>
         <!--Optional:-->
         <description>${deleteMultiple.description}</description>
         <!--Optional:-->
         <due_date>${deleteMultiple.due_date}</due_date>
         <!--Optional:-->
         <escalation>${deleteMultiple.escalation}</escalation>
         <!--Optional:-->
         <expected_start>${deleteMultiple.expected_start}</expected_start>
         <!--Optional:-->
         <follow_up>${deleteMultiple.follow_up}</follow_up>
         <!--Optional:-->
         <group_list>${deleteMultiple.group_list}</group_list>
         <!--Optional:-->
         <hold_reason>${deleteMultiple.hold_reason}</hold_reason>
         <!--Optional:-->
         <impact>${deleteMultiple.impact}</impact>
         <!--Optional:-->
         <incident_state>${deleteMultiple.incident_state}</incident_state>
         <!--Optional:-->
         <knowledge>${deleteMultiple.knowledge}</knowledge>
         <!--Optional:-->
         <location>${deleteMultiple.location}</location>
         <!--Optional:-->
         <made_sla>${deleteMultiple.made_sla}</made_sla>
         <!--Optional:-->
         <needs_attention>${deleteMultiple.needs_attention}</needs_attention>
         <!--Optional:-->
         <notify>${deleteMultiple.notify}</notify>
         <!--Optional:-->
         <number>${deleteMultiple.number}</number>
         <!--Optional:-->
         <opened_at>${deleteMultiple.opened_at}</opened_at>
         <!--Optional:-->
         <opened_by>${deleteMultiple.opened_by}</opened_by>
         <!--Optional:-->
         <order>${deleteMultiple.order}</order>
         <!--Optional:-->
         <origin_id>${deleteMultiple.origin_id}</origin_id>
         <!--Optional:-->
         <origin_table>${deleteMultiple.origin_table}</origin_table>
         <!--Optional:-->
         <parent>${deleteMultiple.parent}</parent>
         <!--Optional:-->
         <parent_incident>${deleteMultiple.parent_incident}</parent_incident>
         <!--Optional:-->
         <priority>${deleteMultiple.priority}</priority>
         <!--Optional:-->
         <problem_id>${deleteMultiple.problem_id}</problem_id>
         <!--Optional:-->
         <reassignment_count>${deleteMultiple.reassignment_count}</reassignment_count>
         <!--Optional:-->
         <reopen_count>${deleteMultiple.reopen_count}</reopen_count>
         <!--Optional:-->
         <reopened_by>${deleteMultiple.reopened_by}</reopened_by>
         <!--Optional:-->
         <reopened_time>${deleteMultiple.reopened_time}</reopened_time>
         <!--Optional:-->
         <resolved_at>${deleteMultiple.resolved_at}</resolved_at>
         <!--Optional:-->
         <resolved_by>${deleteMultiple.resolved_by}</resolved_by>
         <!--Optional:-->
         <rfc>${deleteMultiple.rfc}</rfc>
         <!--Optional:-->
         <route_reason>${deleteMultiple.route_reason}</route_reason>
         <!--Optional:-->
         <service_offering>${deleteMultiple.service_offering}</service_offering>
         <!--Optional:-->
         <severity>${deleteMultiple.severity}</severity>
         <!--Optional:-->
         <short_description>${deleteMultiple.short_description}</short_description>
         <!--Optional:-->
         <skills>${deleteMultiple.skills}</skills>
         <!--Optional:-->
         <sla_due>${deleteMultiple.sla_due}</sla_due>
         <!--Optional:-->
         <state>${deleteMultiple.state}</state>
         <!--Optional:-->
         <subcategory>${deleteMultiple.subcategory}</subcategory>
         <!--Optional:-->
         <sys_class_name>${deleteMultiple.sys_class_name}</sys_class_name>
         <!--Optional:-->
         <sys_created_by>${deleteMultiple.sys_created_by}</sys_created_by>
         <!--Optional:-->
         <sys_created_on>${deleteMultiple.sys_created_on}</sys_created_on>
         <!--Optional:-->
         <sys_domain>${deleteMultiple.sys_domain}</sys_domain>
         <!--Optional:-->
         <sys_domain_path>${deleteMultiple.sys_domain_path}</sys_domain_path>
         <!--Optional:-->
         <sys_id>${deleteMultiple.sys_id}</sys_id>
         <!--Optional:-->
         <sys_mod_count>${deleteMultiple.sys_mod_count}</sys_mod_count>
         <!--Optional:-->
         <sys_updated_by>${deleteMultiple.sys_updated_by}</sys_updated_by>
         <!--Optional:-->
         <sys_updated_on>${deleteMultiple.sys_updated_on}</sys_updated_on>
         <!--Optional:-->
         <task_effective_number>${deleteMultiple.task_effective_number}</task_effective_number>
         <!--Optional:-->
         <time_worked>${deleteMultiple.time_worked}</time_worked>
         <!--Optional:-->
         <u_more_info>${deleteMultiple.u_more_info}</u_more_info>
         <!--Optional:-->
         <u_more_info_journal>${deleteMultiple.u_more_info_journal}</u_more_info_journal>
         <!--Optional:-->
         <universal_request>${deleteMultiple.universal_request}</universal_request>
         <!--Optional:-->
         <upon_approval>${deleteMultiple.upon_approval}</upon_approval>
         <!--Optional:-->
         <upon_reject>${deleteMultiple.upon_reject}</upon_reject>
         <!--Optional:-->
         <urgency>${deleteMultiple.urgency}</urgency>
         <!--Optional:-->
         <user_input>${deleteMultiple.user_input}</user_input>
         <!--Optional:-->
         <watch_list>${deleteMultiple.watch_list}</watch_list>
         <!--Optional:-->
         <work_end>${deleteMultiple.work_end}</work_end>
         <!--Optional:-->
         <work_notes>${deleteMultiple.work_notes}</work_notes>
         <!--Optional:-->
         <work_notes_list>${deleteMultiple.work_notes_list}</work_notes_list>
         <!--Optional:-->
         <work_start>${deleteMultiple.work_start}</work_start>
      </inc:deleteMultiple>
   </soapenv:Body>
</soapenv:Envelope>]]></envelope>
        <function_name>deleteMultiple</function_name>
        <key_store/>
        <key_store_alias/>
        <key_store_password/>
        <lock>false</lock>
        <protocol_profile/>
        <qualified_name>Incident [ deleteMultiple ]</qualified_name>
        <soap_action>http://www.service-now.com/incident/deleteMultiple</soap_action>
        <soap_endpoint>https://dev36074.service-now.com/incident.do?SOAP</soap_endpoint>
        <soap_message display_value="Incident">66f5d4c3979f7d5081a6bb46f053afc8</soap_message>
        <strip_whitespace>false</strip_whitespace>
        <sys_class_name>sys_soap_message_function</sys_class_name>
        <sys_created_by>narendranath.reddy</sys_created_by>
        <sys_created_on>2023-12-28 06:59:28</sys_created_on>
        <sys_id>1e361007979f7d5081a6bb46f053afd5</sys_id>
        <sys_mod_count>0</sys_mod_count>
        <sys_name>deleteMultiple</sys_name>
        <sys_package display_value="NeedIt" source="x_58872_needit">6ead8e780f603200cd674f8ce1050ed1</sys_package>
        <sys_policy/>
        <sys_scope display_value="NeedIt">6ead8e780f603200cd674f8ce1050ed1</sys_scope>
        <sys_update_name>sys_soap_message_function_1e361007979f7d5081a6bb46f053afd5</sys_update_name>
        <sys_updated_by>narendranath.reddy</sys_updated_by>
        <sys_updated_on>2023-12-28 06:59:28</sys_updated_on>
        <use_basic_auth>false</use_basic_auth>
        <use_mid_server/>
        <use_ws_security>false</use_ws_security>
        <ws_security_type/>
        <ws_security_username_profile/>
        <ws_security_x509_profile/>
    </sys_soap_message_function>
</record_update>
